# frozen_string_literal: true

# tap
tap 'daipeihust/tap'
tap 'gcenx/wine'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'osx-cross/avr'

# brew
brew 'gh'
brew 'git'
brew 'ykman'
brew 'gnupg'
brew 'pinentry-mac'

brew 'neovim'
brew 'tmux'
brew 'zsh'
brew 'ffmpeg'
brew 'imagemagick'
brew 'deno'

brew 'mas'
brew 'daipeihust/tap/im-select'

brew 'htop'
brew 'ncdu'
brew 'jq'
brew 'neofetch'
brew 'gcc'
brew 'llvm'
brew 'openssh'

# cask
cask '1password'
cask '1password-cli'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'
cask 'yubico-yubikey-piv-manager'
cask 'keybase'

cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'wireshark'
cask 'docker'
cask 'firecamp'
cask 'iterm2'

cask 'arc'
cask 'firefox-developer-edition'
cask 'google-chrome'

cask 'karabiner-elements'
cask 'bettertouchtool'
cask 'appcleaner'
cask 'raycast'
cask 'logitech-options'
cask 'macs-fan-control'
cask 'google-japanese-ime'

cask 'deepl'
cask 'discord'
cask 'grammarly'
cask 'slack'
cask 'spotify'
cask 'ticktick'
cask 'typora'

# mas
mas 'LINE', id: 539_883_307
mas 'RunCat', id: 1_429_033_973
mas 'WireGuard', id: 1_451_685_025
